<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>
<head>
	<meta http-equiv="content-type" content="text/html; charset=iso-8859-1"/>
	<title></title>
	<meta name="generator" content="LibreOffice 6.1.5.2 (Linux)"/>
	<meta name="author" content="ASUS PC"/>
	<meta name="created" content="2024-06-07T17:14:00"/>
	<meta name="changedby" content="ASUS PC"/>
	<meta name="changed" content="2024-06-07T17:15:00"/>
	<meta name="AppVersion" content="16.0000"/>
	<meta name="DocSecurity" content="0"/>
	<meta name="HyperlinksChanged" content="false"/>
	<meta name="LinksUpToDate" content="false"/>
	<meta name="ScaleCrop" content="false"/>
	<meta name="ShareDoc" content="false"/>
	<style type="text/css">
		@page { size: 8.5in 11in; margin: 1in }
		p { margin-bottom: 0.1in; direction: ltr; line-height: 115%; text-align: left; orphans: 2; widows: 2; background: transparent }
		p.ctl { font-family: "Arial Unicode MS" }
	</style>
</head>
<body lang="en-US" link="#000080" vlink="#800000" dir="ltr"><p class="western" style="margin-bottom: 0.11in; line-height: 108%">
<font face="Arial Unicode MS"><font size="5" style="font-size: 18pt"><span lang="km-KH"><font face="DaunPenh">&#6047;&#6098;&#6044;&#6070;&#6018;&#6040;&#6035;&#6093;&#6040;&#6016;&#6016;&#6070;&#6035;&#6091;&#6040;&#6048;&#6070;&#6044;&#6071;&#6033;&#6098;&#6041;&#6070;&#6043;&#6096;&#6041;&#6044;&#6071;&#6033;&#6098;&#6041;&#6070;&#6047;&#6070;&#6047;&#6098;&#6031;&#6098;&#6042;
&#6035;&#6071;&#6020;&#6036;&#6021;&#6098;&#6021;&#6081;&#6016;&#6044;&#6071;&#6033;&#6098;&#6041;&#6070;&#6035;&#6083;&#6047;&#6070;&#6016;&#6043;&#6044;&#6071;&#6033;&#6098;&#6041;&#6070;&#6043;&#6096;&#6041;&#6016;&#6040;&#6098;&#6038;&#6075;&#6023;&#6070;&#6100;
&#6047;&#6040;&#6098;&#6042;&#6070;&#6036;&#6091;&#6036;&#6098;&#6050;&#6076;&#6035;&#6103;&#6047;&#6071;&#6047;&#6098;&#6047;&#6070;&#6035;&#6075;&#6047;&#6071;&#6047;&#6098;&#6047;
&#6026;&#6082;&#6043;&#6040;&#6070;&#6035;&#6036;&#6086;&#6030;&#6020;&#6021;&#6020;&#6091;&#6036;&#6035;&#6098;&#6031;&#6016;&#6070;&#6042;&#6047;&#6071;&#6016;&#6098;&#6047;&#6070;&#6032;&#6098;&#6035;&#6070;&#6016;&#6091;&#6036;&#6042;&#6071;&#6025;&#6098;&#6025;&#6070;&#6036;&#6031;&#6098;&#6042;&#6042;&#6020;
&#6035;&#6071;&#6020;&#6032;&#6098;&#6035;&#6070;&#6016;&#6091;&#6036;&#6042;&#6071;&#6025;&#6098;&#6025;&#6070;&#6036;&#6031;&#6098;&#6042;&#6100;
&#6047;&#6076;&#6040;&#6021;&#6075;&#6087;&#6024;&#6098;&#6040;&#6084;&#6087;&#6023;&#6070;&#6040;&#6077;&#6041;&#6041;&#6078;&#6020;&#6053;&#6049;&#6076;&#6044;&#6035;&#6081;&#6087;
&#6060;&#6050;&#6070;&#6021;&#6050;&#6025;&#6098;&#6023;&#6078;&#6025;&#6040;&#6016;&#6016;&#6070;&#6035;&#6091;&#6047;&#6070;&#6016;&#6043;&#6044;&#6071;&#6033;&#6098;&#6041;&#6070;&#6043;&#6096;&#6041;&#6037;&#6098;&#6033;&#6070;&#6043;&#6091;&#6016;&#6095;&#6036;&#6070;&#6035;&#6100;</font></span></font></font></p>
<p class="western" style="margin-bottom: 0.11in; line-height: 108%">Welcome
to College of Science and Technology of The University of Cambodia.
For everyone who wishes to pursue for any AA and BA degrees of the
study programs, please register now or visit the campus of The
University of Cambodia.</p>
<p class="western" style="margin-bottom: 0.11in; line-height: 108%">Our
Information Technology Management for Business (ITMB) degree covers a
vibrant mix of transferable skills and knowledge for those who want
exciting and challenging management or professional careers
designing, developing and implementing technology solutions for
businesses. The ITMB degree is designed to offer an insight into the
real world of IT. It allows you to learn the people and project
management skills required to be a successful IT professional.</p>
<p class="western" style="margin-bottom: 0.11in; line-height: 108%">Program
Learning Outcomes</p>
<p class="western" style="margin-bottom: 0.11in; line-height: 108%">As
a graduate, you will be prepared to reliably demonstrate the ability
to: 1-Analyze business problems and make ethically sound strategic
decisions enabled by Information Technology (IT).</p>
<p class="western" style="margin-bottom: 0.11in; line-height: 108%">M2-anage
a business technology project within a cross-functional and
multi-disciplinary team by applying project management principles.</p>
<p class="western" style="margin-bottom: 0.11in; line-height: 108%">3-Adopt
operations management principles and information technology to
improve efficiency and effectiveness of business processes.</p>
<p class="western" style="margin-bottom: 0.11in; line-height: 108%">4-Propose
strategic and operational solutions by applying principles of
management accounting and financial analysis.</p>
<p class="western" style="margin-bottom: 0.11in; line-height: 108%">5-Design
information technology solutions that automate and support business
processes.</p>
<p class="western" style="margin-bottom: 0.11in; line-height: 108%">6-Model
ethical, legal and professional codes of conduct of the Canadian
business environment and global marketplace.</p>
<p class="western" style="margin-bottom: 0.11in; line-height: 108%">7-Build
data solutions to support business operations, strategic decision
making and business planning to improve organizational performance
and ensure adequate risk management.</p>
<p class="western" style="margin-bottom: 0.11in; line-height: 108%">8-Evaluate
organizational structures and management processes, with a focus on
small and medium-sized enterprises, to improve organizational
performance.</p>
<p class="western" style="margin-bottom: 0.11in; line-height: 108%">9-Provide
direction about the opportunities for the integration of technology,
commerce and marketing to support innovative digital business models.</p>
</body>
</html>