<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>
<head>
	<meta http-equiv="content-type" content="text/html; charset=iso-8859-1"/>
	<title></title>
	<meta name="generator" content="LibreOffice 6.1.5.2 (Linux)"/>
	<meta name="author" content="ASUS PC"/>
	<meta name="created" content="2024-06-07T17:24:00"/>
	<meta name="changedby" content="ASUS PC"/>
	<meta name="changed" content="2024-06-07T17:25:00"/>
	<meta name="AppVersion" content="16.0000"/>
	<meta name="DocSecurity" content="0"/>
	<meta name="HyperlinksChanged" content="false"/>
	<meta name="LinksUpToDate" content="false"/>
	<meta name="ScaleCrop" content="false"/>
	<meta name="ShareDoc" content="false"/>
	<style type="text/css">
		@page { size: 8.5in 11in; margin: 1in }
		p { margin-bottom: 0.1in; direction: ltr; line-height: 115%; text-align: left; orphans: 2; widows: 2; background: transparent }
		p.ctl { font-family: "Arial Unicode MS" }
	</style>
</head>
<body lang="en-US" link="#000080" vlink="#800000" dir="ltr"><p class="western" style="margin-bottom: 0.11in; line-height: 108%">
<font face="Arial Unicode MS"><font size="5" style="font-size: 18pt"><span lang="km-KH"><font face="DaunPenh">&#6047;&#6098;&#6044;&#6070;&#6018;&#6040;&#6035;&#6093;&#6040;&#6016;&#6016;&#6070;&#6035;&#6091;&#6040;&#6048;&#6070;&#6044;&#6071;&#6033;&#6098;&#6041;&#6070;&#6043;&#6096;&#6041;&#6044;&#6071;&#6033;&#6098;&#6041;&#6070;&#6047;&#6070;&#6047;&#6098;&#6031;&#6098;&#6042;
&#6035;&#6071;&#6020;&#6036;&#6021;&#6098;&#6021;&#6081;&#6016;&#6044;&#6071;&#6033;&#6098;&#6041;&#6070;&#6035;&#6083;&#6047;&#6070;&#6016;&#6043;&#6044;&#6071;&#6033;&#6098;&#6041;&#6070;&#6043;&#6096;&#6041;&#6016;&#6040;&#6098;&#6038;&#6075;&#6023;&#6070;&#6100;
&#6047;&#6040;&#6098;&#6042;&#6070;&#6036;&#6091;&#6036;&#6098;&#6050;&#6076;&#6035;&#6103;&#6047;&#6071;&#6047;&#6098;&#6047;&#6070;&#6035;&#6075;&#6047;&#6071;&#6047;&#6098;&#6047;
&#6026;&#6082;&#6043;&#6040;&#6070;&#6035;&#6036;&#6086;&#6030;&#6020;&#6021;&#6020;&#6091;&#6036;&#6035;&#6098;&#6031;&#6016;&#6070;&#6042;&#6047;&#6071;&#6016;&#6098;&#6047;&#6070;&#6032;&#6098;&#6035;&#6070;&#6016;&#6091;&#6036;&#6042;&#6071;&#6025;&#6098;&#6025;&#6070;&#6036;&#6031;&#6098;&#6042;&#6042;&#6020;
&#6035;&#6071;&#6020;&#6032;&#6098;&#6035;&#6070;&#6016;&#6091;&#6036;&#6042;&#6071;&#6025;&#6098;&#6025;&#6070;&#6036;&#6031;&#6098;&#6042;&#6100;
&#6047;&#6076;&#6040;&#6021;&#6075;&#6087;&#6024;&#6098;&#6040;&#6084;&#6087;&#6023;&#6070;&#6040;&#6077;&#6041;&#6041;&#6078;&#6020;&#6053;&#6049;&#6076;&#6044;&#6035;&#6081;&#6087;
&#6060;&#6050;&#6070;&#6021;&#6050;&#6025;&#6098;&#6023;&#6078;&#6025;&#6040;&#6016;&#6016;&#6070;&#6035;&#6091;&#6047;&#6070;&#6016;&#6043;&#6044;&#6071;&#6033;&#6098;&#6041;&#6070;&#6043;&#6096;&#6041;&#6037;&#6098;&#6033;&#6070;&#6043;&#6091;&#6016;&#6095;&#6036;&#6070;&#6035;&#6100;</font>&nbsp;</span></font></font></p>
<p class="western" style="margin-bottom: 0.11in; line-height: 108%">Welcome
to College of Science and Technology of The University of Cambodia.
For everyone who wishes to pursue for any AA and BA degrees of the
study programs, please register now or visit the campus of The
University of Cambodia.</p>
<p class="western" style="margin-bottom: 0.11in; line-height: 108%">Cybersecurity
is the use of technologies, processes, and controls to protect a
computer or network from malicious attacks. For network engineers,
cybersecurity focuses on protecting the integrity of networks and
data</p>
<p class="western" style="margin-bottom: 0.11in; line-height: 108%">Program
Learning Outcomes</p>
<p class="western" style="margin-bottom: 0.11in; line-height: 108%">Our
five learning outcomes are: To develop Cybersecurity graduates&hellip;</p>
<p class="western" style="margin-bottom: 0.11in; line-height: 108%">1.with
the technical knowledge and skills needed to secure computer systems
and networks.</p>
<p class="western" style="margin-bottom: 0.11in; line-height: 108%">2.that
can plan, develop, and implement a cybersecurity risk management
program for organizations.</p>
<p class="western" style="margin-bottom: 0.11in; line-height: 108%">3.with
the sufficient red/blue team skills to attack, defend and audit
information system resources.</p>
<p class="western" style="margin-bottom: 0.11in; line-height: 108%">4.that
can secure, manage, and assess cloud-based information resources.</p>
<p class="western" style="margin-bottom: 0.11in; line-height: 108%">5.with
the knowledge to pass an entry-level, professional cybersecurity
certification exam.</p>
</body>
</html>